Revit 2027 API
BendingDetailDisplayParametersOptions Enumeration
 Describes how the parameters will be represented.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BendingDetailDisplayParametersOptions
Public Enumeration BendingDetailDisplayParametersOptions
public enum class BendingDetailDisplayParametersOptions
type BendingDetailDisplayParametersOptions
Members
Member name | Value | Description
ByName | 1 |  Dimensions that are shown will be labeled using the parameters names.
ByValue | 0 |  Dimensions that are shown will be labeled using the parameters values.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace